Repository: Babelruins/aircrack-ng
Catalog: src/locale/*/LC_MESSAGES/airbase-ng.po
Languages: es

source: Original work: Martin Beck
es: Trabajo original: Martin Beck

source: usage: airbase-ng <options> <replay interface>
es: uso: airbase-ng <opciones> <interfaz>

source: Options:
es: Opciones:

source: -a bssid : set Access Point MAC address
es: -a bssid : establece la dirección MAC del punto de acceso

source: -i iface : capture packets from this interface
es: -i interfaz : capturar paquetes desde esta interfaz

source: -w WEP key : use this WEP key to en-/decrypt packets
es: -w clave WEP : usar esta clave WEP para cifrar/descifrar paquetes

source: -h MAC : source mac for MITM mode
es: -h MAC : MAC origen para modo MITM

source: -f disallow : disallow specified client MACs (default: allow)
es: -f disallow : rechazar las MAC de los clientes especificados (por defecto las permite todas)

source: -W 0|1 : [don't] set WEP flag in beacons 0|1 (default: auto)
es: -W 0|1 : [no] establecer el indicador WEP en los paquetes baliza a 0|1 (por defecto: automático)

source: -q : quiet (do not print statistics)
es: -q : silencioso (no mostrar estadísticas)

source: -v : verbose (print more messages)
es: -v : verbosidad (mostrar más mensajes)

source: -A : Ad-Hoc Mode (allows other clients to peer)
es: -A : Modo Ad-Hoc (permite que otros clientes se conecten)

source: -Y in|out|both : external packet processing
es: -Y in|out|both : procesamiento de paquetes externos (in = entrantes, out = salientes, both = ambos)

source: -c channel : sets the channel the AP is running on
es: -c canal : establece el canal donde el AP se encuentra

source: -X : hidden ESSID
es: -X : ESSID oculto

source: -s : force shared key authentication (default: auto)
es: -s : forzar autenticación de clave compartida (por defecto: automático)

source: -S : set shared key challenge length (default: 128)
es: -S : establecer longitud de clave compartida (por defecto: 128)

source: -L : Caffe-Latte WEP attack (use if driver can't send frags)
es: -L : ataque 'Caffe-Latte' para WEP (usar si el controlador no puede enviar fragmentos)

source: -N : cfrag WEP attack (recommended)
es: -N : ataque de fragmentación para WEP (recomendado)

source: -x nbpps : number of packets per second (default: 100)
es: -x npps : número de paquetes por segundo (por defecto: 100)

source: -y : disables responses to broadcast probes
es: -y : desactiva respuesta a paquetes broadcast

source: -0 : set all WPA,WEP,open tags. can't be used with -z & -Z
es: -0 : establece todos los tags a WPA ,WEP o abierta. No puede ser usado con -z o -Z

source: -z type : sets WPA1 tags. 1=WEP40 2=TKIP 3=WRAP 4=CCMP 5=WEP104
es: -z tipo : establece los tags para WPA1. 1=WEP40 2=TKIP 3=WRAP 4=CCMP 5=WEP104

source: -Z type : same as -z, but for WPA2
es: -Z tipo : lo mismo que -z, pero para WPA2

source: -V type : fake EAPOL 1=MD5 2=SHA1 3=auto
es: -V tipo : EAPOL falso 1=MD5 2=SHA1 3=automático

source: -F prefix : write all sent and received frames into pcap file
es: -F prefijo : escribir todos los paquetes enviados y recibidos en un archivo pcap

source: -P : respond to all probes, even when specifying ESSIDs
es: -P : responder a todos los paquetes de sondeo, aún habiendo especificado ESSIDs

source: -I interval : sets the beacon interval value in ms
es: -I intervalo : establece el intervalo de balizas en milisegundos

source: -C seconds : enables beaconing of probed ESSID values (requires -P)
es: -C seconds : activa el embalizamiento de ESSIDs sondeados (requiere -P)

source: Filter options:
es: Opciones de filtrado:

source: --bssid MAC : BSSID to filter/use
es: --bssid MAC : BSSID a filtrar/usar

source: --bssids file : read a list of BSSIDs out of that file
es: --bssids archivo : leer una lista de BSSIDs de ese archivo

source: --client MAC : MAC of client to filter
es: --client MAC : MAC del cliente a filtrar

source: --clients file : read a list of MACs out of that file
es: --clients archivo: leer una lista de MACs de ese archivo

source: --essid ESSID : specify a single ESSID (default: default)
es: --essid ESSID : especificar un solo ESSID (por defecto: default)

source: --essids file : read a list of ESSIDs out of that file
es: --essids archivo : leer una lista de ESSIDs de ese archivo

source: --help : Displays this usage screen
es: --help : Muestra esta ventana de ayuda

source: fwrite(packet header) failed
es: fwrite(cabecera de paquete) falló

source: fwrite(packet data) failed
es: fwrite(datos de paquete) falló

source: fopen failed
es: fopen falló

source: Could not create "%s".
es: No se pudo crear "%s".

source: fwrite(pcap file header) failed
es: fwrite(cabecera de archivo pcap) falló

source: Created capture file "%s".
es: Se creó archivo de captura "%s".

source: error decrypting... len: %d
es: error al descifrar... len: %d

source: Unable to open ESSID list
es: No se pudo abrir lista de ESSIDs

source: Unable to open MAC list
es: No se pudo abrir lista de MACs

source: read(/dev/rtc) failed
es: read(/dev/rtc) falló

source: Broken SKA: %02X:%02X:%02X:%02X:%02X:%02X (expected: %d, got %d bytes)
es: SKA roto: %02X:%02X:%02X:%02X:%02X:%02X (se esperaban %d bytes, se obtuvieron %d)

source: Got %d bytes keystream: %02X:%02X:%02X:%02X:%02X:%02X
es: Se obtuvo keystream de %d bytes: %02X:%02X:%02X:%02X:%02X:%02X

source: Is this really a PRGA file: %s?
es: ¿Es %s en verdad un archivo PRGA?

source: Error opening %s
es: Error al abrir %s

source: fread failed
es: fread falló

source: Are you really sure that this is a valid keystream? Because the index is out of range (0-3): %02X
es: ¿Estás seguro de que este es un keystream válido? Porque el índice está fuera de rango (0-3): %02X

source: Size: %d, FromDS: %d, ToDS: %d
es: Tamaño: %d, FromDS: %d, ToDS: %d

source: --- CUT ---
es: --- CORTE ---

source: Please specify a WEP key (-w).
es: Por favor, especifica una clave WEP (-w).

source: Please specify a longer PRGA file (-y) with at least %i bytes.
es: Por favor, especifica un archivo PRGA más grande (-y) de al menos %i bytes.

source: Ignored IPv6 packet.
es: Paquete IPv6 ignorado.

source: Ignored DHCP Discover packet.
es: Paquete DHCP Discover ignorado.

source: Starting Hirte attack against %02X:%02X:%02X:%02X:%02X:%02X at %d pps.
es: Empezando ataque Hirte contra %02X:%02X:%02X:%02X:%02X:%02X a %d pps.

source: Added %s packet to cfrag buffer.
es: Paquete %s añadido a buffer cfrag.

source: Starting Caffe-Latte attack against %02X:%02X:%02X:%02X:%02X:%02X at %d pps.
es: Empezando ataque Caffe-Latte contra %02X:%02X:%02X:%02X:%02X:%02X a %d pps.

source: Added an ARP to the caffe-latte ringbuffer %d/%d
es: Añadido un ARP al ringbuffer caffe-latte %d/%d

source: fwrite(IVs file MAGIC) failed
es: fwrite(MAGIC de archivo IVs) falló

source: fwrite(IVs file header) failed
es: fwrite(cabecera de archivo IVs) falló

source: fwrite(IV header) failed
es: fwrite(cabecera de IV) falló

source: fwrite(IV bssid) failed
es: fwrite(bssid de IV) falló

source: fwrite(IV essid) failed
es: fwrite(essid de IV) falló

source: fwrite(IV wpa_hdsk) failed
es: fwrite(handshake wpa de IV) falló

source: malloc failed
es: malloc falló

source: Got EAPOL start frame from %02X:%02X:%02X:%02X:%02X:%02X
es: Se obtuvo paquete EAPOL inicial de %02X:%02X:%02X:%02X:%02X:%02X

source: Got WPA handshake from %02X:%02X:%02X:%02X:%02X:%02X
es: Se obtuvo handshake WPA de %02X:%02X:%02X:%02X:%02X:%02X

source: Got directed probe request from %02X:%02X:%02X:%02X:%02X:%02X - "%s"
es: Se obtuvo probe request dirigido desde %02X:%02X:%02X:%02X:%02X:%02X - "%s"

source: Error: Got channel %d, expected a value < 256. Please report.
es: Error: Se obtuvo canal %d, se esperaba un valor < 256. Favor reportar.

source: Got broadcast probe request from %02X:%02X:%02X:%02X:%02X:%02X
es: Se obutvo probe request a broadcast desde %02X:%02X:%02X:%02X:%02X:%02X

source: Got an auth request from %02X:%02X:%02X:%02X:%02X:%02X (open system)
es: Se obtuvo un auth request de %02X:%02X:%02X:%02X:%02X:%02X (sistema abierto)

source: Got an auth request from %02X:%02X:%02X:%02X:%02X:%02X (shared key)
es: Se obtuvo un auth request de %02X:%02X:%02X:%02X:%02X:%02X (clave compartida)

source: SKA from %02X:%02X:%02X:%02X:%02X:%02X
es: SKA de %02X:%02X:%02X:%02X:%02X:%02X

source: Client %02X:%02X:%02X:%02X:%02X:%02X %sassociated
es: Cliente %02X:%02X:%02X:%02X:%02X:%02X %sasociado

source: (unencrypted)
es: (descifrado)

source: Error sending beacon!
es: ¡Error enviando paquete baliza!

source: "%s --help" for help.
es: "%s --help" para obtener ayuda.

source: Invalid AP MAC address.
es: Dirección MAC de AP inválida.

source: Invalid channel value <%d>. It must be between 1 and 255.
es: Valor de canal inválido: <%d>. Debe estar entre 1 y 255.

source: EAPOL value can only be 1[MD5], 2[SHA1] or 3[auto].
es: Valor EAPOL solo puede ser 1[MD5], 2[SHA1] o 3[automático].

source: Don't specify -v and -q at the same time.
es: No especificar -v y -q al mismo tiempo.

source: Invalid WPA1 type [1-5]
es: Tipo de WPA1 inválido [1-5]

source: Invalid WPA2 type [1-5]
es: Tipo de WPA2 inválido [1-5]

source: Invalid ESSID, too long
es: ESSID inválido, es muy largo

source: Invalid speed. [1-1000]
es: Velocidad inválida. [1-1000]

source: Invalid macfilter mode. [allow|disallow]
es: Modo de filtrado MAC inválido. [allow|disallow]

source: Invalid challenge length. [16-1480]
es: Longitud de clave compartida inválida. [16-1480]

source: Invalid source MAC address.
es: Dirección MAC origen inválida.

source: Packet source already specified.
es: Origen de paquetes ya especificado.

source: Invalid argument for (-W). Only "0" and "1" allowed.
es: Argumento inválido para (-W). Solo "0" y "1" están permitidos.

source: Invalid processing mode. [in|out|both]
es: Modo de procesamiento inválido. [in|out|both]

source: PRGA file already specified.
es: Archivo PRGA ya especificado.

source: Encryption key already specified.
es: Clave de cifrado ya especificada.

source: Invalid WEP key.
es: Clave WEP inválida.

source: Invalid WEP key length.
es: Longitud de clave WEP inválida.

source: Notice: dump prefix already given
es: Aviso: prefijo dump ya especificado

source: Invalid BSSID address.
es: Dirección BSSID inválida.

source: No replay interface specified.
es: No se ha especificado interfaz.

source: Notice: specify bssid "--bssid" with "--netmask"
es: Aviso: especificar bssid "--bssid" con "--netmask"

source: Notice: You need to specify exactly one BSSID (-b) and at least one client MAC (-d)
es: Aviso: Necesitas especificar exactamente un BSSID (-b) y al menos una MAC cliente (-d)

source: Notice: You can only set one method: WPA (-z) or WPA2 (-Z)
es: Aviso: Solo puedes especificar un método: WPA (-z) o WPA2 (-Z)

source: Notice: You cannot use all WPA tags (-0) together with WPA (-z) or WPA2 (-Z)
es: Aviso: No puedes usar todos los tags WPA (-0) junto con WPA (-z) o WPA2 (-Z)

source: ioctl(RTC_IRQP_SET) failed
es: ioctl(RTC_IRQP_SET) falló

source: Make sure enhanced rtc device support is enabled in the kernel (module rtc, not genrtc) - also try 'echo 1024 >/proc/sys/dev/rtc/max-user-freq'.
es: Asegúrate de que el soporte para enhanced rtc esté habilitado en el kernel (módulo rtc, no genrtc) - también intenta 'echo 1024 >/proc/sys/dev/rtc/max-user-freq'.

source: ioctl(RTC_PIE_ON) failed
es: ioctl(RTC_PIE_ON) falló

source: For information, no action required: Using gettimeofday() instead of /dev/rtc
es: Dato informativo, no se requiere tomar acciones: Usando gettimeofday() en lugar de /dev/rtc

source: open failed
es: open falló

source: fread(pcap file header) failed
es: fread(cabecera de archivo pcap) falló

source: "%s" isn't a pcap file (expected TCPDUMP_MAGIC).
es: "%s" no es un archivo pcap (se esperaba TCPDUMP_MAGIC).

source: Wrong linktype from pcap file header (expected LINKTYPE_IEEE802_11) - this doesn't look like a regular 802.11 capture.
es: Linktype erróneo en la cabecera del archivo pcap (se esperaba LINKTYPE_IEEE802_11) - no parece ser una captura 802.11 regular.

source: error opening tap device: %s
es: error abriendo dispositivo TAP: %s

source: Created tap interface %s
es: Interfaz TAP %s creada

source: Trying to set MTU on %s to %i
es: Tratando de establecer MTU en %s a %i

source: error setting MTU on %s
es: error estableciendo MTU en %s

source: MTU on %s remains at %i
es: MTU en %s permanece en %i

source: Created tap interface %s for external processing.
es: Se creó interfaz TAP %s para procesamiento externo.

source: You need to get the interfaces up, read the fames [,modify]
es: Necesitas levantar las interfaces, leer los paquetes [, modificarlos]

source: and send them back through the same interface "%s".
es: y enviarlos de vuelta usando la misma interfaz "%s".

source: ti_set_mac failed
es: ti_set_mac falló

source: You most probably want to set the MAC of your TAP interface.
es: Muy probablemente quieras establecer la MAC de tu interfaz TAP.

source: ifconfig <iface> hw ether %02X:%02X:%02X:%02X:%02X:%02X
es: ifconfig <interfaz> hw ether %02X:%02X:%02X:%02X:%02X:%02X

source: Couldn't set MAC on interface "%s".
es: No se pudo establecer MAC en la interfaz "%s".

source: Sending beacons in Ad-Hoc mode for Cell %02X:%02X:%02X:%02X:%02X:%02X.
es: Enviando paquetes en modo Ad-Hoc para celda %02X:%02X:%02X:%02X:%02X:%02X.

source: Access Point with BSSID %02X:%02X:%02X:%02X:%02X:%02X started.
es: Iniciado Punto de Acceso con BSSID %02X:%02X:%02X:%02X:%02X:%02X.

source: Finished reading input file %s.
es: Terminado de leer archivo de entrada %s.
